{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph, URIRef, Namespace\n",
    "from api.src.schemas.authorities.authority import Authority\n",
    "from api.src.function.authorities.makeGraph import MakeGraphSubject\n",
    "from api.src.function.authorities.generateID import GenerateId\n",
    "from pyfuseki import FusekiUpdate, FusekiQuery\n",
    "from api.src.routes.translate.makeTranslate import MakeTranslate\n",
    "from pysolr import Solr\n",
    "import json\n",
    "import httpx\n",
    "from api.src.function.loc.graphExist import GraphExist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<response>\\n\\n<lst name=\"responseHeader\">\\n  <int name=\"status\">0</int>\\n  <int name=\"QTime\">46</int>\\n</lst>\\n</response>\\n'"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "upThesaurus = FusekiUpdate('http://localhost:3030', 'authorities')\n",
    "\n",
    "d = \"\"\"DELETE { graph ?g { ?s ?p ?o } } \n",
    "        WHERE {\n",
    "        graph ?g {?s ?p ?o.}\n",
    "        }\"\"\"\n",
    "\n",
    "response = upThesaurus.run_sparql(d)\n",
    "response.convert()\n",
    "\n",
    "solr = Solr('http://localhost:8983/solr/authorities/', timeout=10)\n",
    "solr.delete(q=\"*:*\",  commit=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "url = 'http://localhost:8000/authorities/loc/subject?uri=http%3A%2F%2Fid.loc.gov%2Fauthorities%2Fsubjects%2Fsh85076502'\n",
    "r = httpx.get(url)\n",
    "r.json()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "201"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "headers = {\n",
    "    'accept': 'application/json',\n",
    "    'Content-Type': 'application/json',\n",
    "}\n",
    "response = httpx.post(\n",
    "    'http://localhost:8000/authorities/mads/subject/', headers=headers, json=r.json())\n",
    "response.status_code"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "201"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "headers = {\n",
    "    'accept': 'application/json',\n",
    "    'Content-Type': 'application/json',\n",
    "}\n",
    "\n",
    "json_data = {\n",
    "    'type': 'Topic',\n",
    "    'adminMetadata': {\n",
    "        'assigner': 'http://id.loc.gov/vocabulary/organizations/dlc',\n",
    "        'descriptionModifier': 'http://id.loc.gov/vocabulary/organizations/brmninpa',\n",
    "        'creationDate': '2023-05-09',\n",
    "        'descriptionLanguage': 'http://id.loc.gov/vocabulary/languages/por',\n",
    "        'generationProcess': 'BiblioKeia v.1',\n",
    "        'generationDate': '2023-05-09T15:07:54',\n",
    "        'identifiedBy': [\n",
    "            {\n",
    "                'type': 'Lccn',\n",
    "                'assigner': 'http://id.loc.gov/vocabulary/organizations/dlc',\n",
    "                'value': 'sh85076502',\n",
    "            },\n",
    "        ],\n",
    "        'status': {\n",
    "            'value': 'mstatus:new',\n",
    "            'label': 'novo',\n",
    "        },\n",
    "    },\n",
    "    'elementList': [\n",
    "        {\n",
    "            'type': 'TopicElement',\n",
    "            'elementValue': {\n",
    "                'value': 'Bibliotecas',\n",
    "                'lang': 'pt',\n",
    "            },\n",
    "        },\n",
    "    ],\n",
    "    'note': None,\n",
    "    'hasBroaderAuthority': [\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85038731',\n",
    "            'label': {\n",
    "                'value': 'Documentation',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85108685',\n",
    "            'label': {\n",
    "                'value': 'Public institutions',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "    ],\n",
    "    'hasCloseExternalAuthority': [\n",
    "        {\n",
    "            'value': 'http://www.yso.fi/onto/yso/p2787',\n",
    "            'label': {\n",
    "                'value': 'kirjastot',\n",
    "                'lang': 'fi',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997341',\n",
    "            'label': {\n",
    "                'value': 'Libraries',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://d-nb.info/gnd/4006439-6',\n",
    "            'label': {\n",
    "                'value': 'Bibliothek',\n",
    "                'lang': 'de',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://www.wikidata.org/entity/Q7075',\n",
    "            'label': {\n",
    "                'value': 'library',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://data.bnf.fr/ark:/12148/cb13318325d',\n",
    "            'label': {\n",
    "                'value': 'Bibliothèques',\n",
    "                'lang': 'fr',\n",
    "            },\n",
    "        },\n",
    "    ],\n",
    "    'hasExactExternalAuthority': [\n",
    "        {\n",
    "            'value': 'http://lod.nal.usda.gov/nalt/47259',\n",
    "            'label': {\n",
    "                'value': 'libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "    ],\n",
    "    'hasNarrowerAuthority': [\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85144359',\n",
    "            'label': {\n",
    "                'value': 'Volunteer workers in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2006003914',\n",
    "            'label': {\n",
    "                'value': 'Young adult fiction in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85002002',\n",
    "            'label': {\n",
    "                'value': 'African Americans and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076716',\n",
    "            'label': {\n",
    "                'value': 'Library resources',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85064278',\n",
    "            'label': {\n",
    "                'value': 'Illegal libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh90005545',\n",
    "            'label': {\n",
    "                'value': 'Computer specialists in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076583',\n",
    "            'label': {\n",
    "                'value': 'Traveling libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076560',\n",
    "            'label': {\n",
    "                'value': 'International libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2016001293',\n",
    "            'label': {\n",
    "                'value': 'Makerspaces in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076572',\n",
    "            'label': {\n",
    "                'value': 'Rental libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076567',\n",
    "            'label': {\n",
    "                'value': 'Proprietary libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85123595',\n",
    "            'label': {\n",
    "                'value': 'Small libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2019103075',\n",
    "            'label': {\n",
    "                'value': 'Open educational resources in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh99003406',\n",
    "            'label': {\n",
    "                'value': 'Association libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2003000502',\n",
    "            'label': {\n",
    "                'value': 'Joint-use libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh89000080',\n",
    "            'label': {\n",
    "                'value': 'Gay libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85048069',\n",
    "            'label': {\n",
    "                'value': 'Fiction in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh95010034',\n",
    "            'label': {\n",
    "                'value': 'Māori (New Zealand people) and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2018000796',\n",
    "            'label': {\n",
    "                'value': 'Wikis and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh96009061',\n",
    "            'label': {\n",
    "                'value': 'Cambodian Americans and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2015000116',\n",
    "            'label': {\n",
    "                'value': 'Web applications in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85064456',\n",
    "            'label': {\n",
    "                'value': 'Imaginary books and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85101156',\n",
    "            'label': {\n",
    "                'value': 'Photocopying services in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh86003586',\n",
    "            'label': {\n",
    "                'value': 'Hispanic Americans and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076505',\n",
    "            'label': {\n",
    "                'value': 'Branch libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076573',\n",
    "            'label': {\n",
    "                'value': 'Special libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85113044',\n",
    "            'label': {\n",
    "                'value': 'Research libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85108703',\n",
    "            'label': {\n",
    "                'value': 'Public libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076584',\n",
    "            'label': {\n",
    "                'value': 'Academic libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2006000644',\n",
    "            'label': {\n",
    "                'value': 'Romanies and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2002001003',\n",
    "            'label': {\n",
    "                'value': 'Bulletin boards in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh95006771',\n",
    "            'label': {\n",
    "                'value': 'Literature in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2003004419',\n",
    "            'label': {\n",
    "                'value': 'Teenage volunteer workers in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh95008857',\n",
    "            'label': {\n",
    "                'value': 'Digital libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh88004059',\n",
    "            'label': {\n",
    "                'value': 'Asian Americans and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076565',\n",
    "            'label': {\n",
    "                'value': 'Private libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh87008010',\n",
    "            'label': {\n",
    "                'value': 'Telecommunication in libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85076576',\n",
    "            'label': {\n",
    "                'value': 'Subscription libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh99003407',\n",
    "            'label': {\n",
    "                'value': 'Volunteer libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2014002646',\n",
    "            'label': {\n",
    "                'value': 'Indian tribal libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2001006867',\n",
    "            'label': {\n",
    "                'value': 'Hungarian Americans and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh85118345',\n",
    "            'label': {\n",
    "                'value': 'School libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh2019000029',\n",
    "            'label': {\n",
    "                'value': 'Little free libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh96008065',\n",
    "            'label': {\n",
    "                'value': 'German Americans and libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.loc.gov/authorities/subjects/sh98003888',\n",
    "            'label': {\n",
    "                'value': 'Bookbinding libraries',\n",
    "                'lang': 'en',\n",
    "            },\n",
    "        },\n",
    "    ],\n",
    "    'hasNarrowerExternalAuthority': [\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997399',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Forecasting',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997379',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Cost control',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997481',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Technological innovations',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/1353572',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Manuscripts',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997395',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Endowments',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997435',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Safety measures',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997390',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Decision making',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997382',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Costs',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997487',\n",
    "            'label': {\n",
    "                'value': 'Libraries--U.S. states--Technological innovations',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997408',\n",
    "            'label': {\n",
    "                'value': 'Libraries--In-service training',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997365',\n",
    "            'label': {\n",
    "                'value': 'Libraries--British colonies',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997376',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Computer network resources',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997393',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Directories',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997484',\n",
    "            'label': {\n",
    "                'value': 'Libraries--U.S. states',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997391',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Design and construction',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997400',\n",
    "            'label': {\n",
    "                'value': 'Libraries--French colonies',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997476',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Standards',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997409',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Information services',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997342',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Accidents',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997485',\n",
    "            'label': {\n",
    "                'value': 'Libraries--U.S. states--Automation',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997403',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Historiography',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997417',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Models',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997380',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Cost effectiveness',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997371',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Certification',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997421',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Psychological aspects',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997374',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Collectibles',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997447',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Sources',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997378',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Congresses',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997375',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Communication systems',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997418',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Periodicals',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997422',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Public opinion',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/1353570',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Administration',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997436',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Safety measures--Planning',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997412',\n",
    "            'label': {\n",
    "                'value': 'Libraries--International cooperation',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997477',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Study and teaching',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997394',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Economic aspects',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997373',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Citizen participation',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997402',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Handbooks, manuals, etc.',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997445',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Social aspects',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997419',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Planning',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997396',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Equipment and supplies',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997384',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Customer services',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997420',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Political aspects',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997483',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Transportation',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997381',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Cost of operation',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997346',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Audio-visual aids',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997410',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Information technology',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997478',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Study and teaching (Elementary)',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            'value': 'http://id.worldcat.org/fast/997434',\n",
    "            'label': {\n",
    "                'value': 'Libraries--Research',\n",
    "                'lang': None,\n",
    "            },\n",
    "        },\n",
    "    ],\n",
    "    'hasVariant': None,\n",
    "    'subjectOf': None,\n",
    "    'isMemberOfMADSCollection': 'http://bibliokeia.com/authorities/Topic/',\n",
    "}\n",
    "\n",
    "response = httpx.post('http://localhost:8000/authorities/mads/subject/', headers=headers, json=json_data)\n",
    "response.status_code"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open('exemples/response_1683650145811.json', encoding='utf-8') as file:\n",
    "    reader = file.read()\n",
    "    r = json.loads(reader)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "r = {\"type\": \"Topic\",\n",
    " \"adminMetadata\": {\"assigner\": \"http://id.loc.gov/vocabulary/organizations/dlc\",\n",
    "  \"descriptionModifier\": \"http://id.loc.gov/vocabulary/organizations/brmninpa\",\n",
    "  \"creationDate\": \"2023-05-09\",\n",
    "  \"descriptionLanguage\": \"http://id.loc.gov/vocabulary/languages/por\",\n",
    "  \"generationProcess\": \"BiblioKeia v.1\",\n",
    "  \"generationDate\": \"2023-05-09T15:07:54\",\n",
    "  \"identifiedBy\": [{\"type\": \"Lccn\",\n",
    "    \"assigner\": \"http://id.loc.gov/vocabulary/organizations/dlc\",\n",
    "    \"value\": \"sh85076502\"}],\n",
    "  \"status\": {\"value\": \"mstatus:new\", \"label\": \"novo\"}},\n",
    " \"elementList\": [{\"type\": \"TopicElement\",\n",
    "   \"elementValue\": {\"value\": \"Bibliotecas\", \"lang\": \"pt\"}}],\n",
    " \"hasBroaderAuthority\": [{\"value\": \"http://id.loc.gov/authorities/subjects/sh85038731\",\n",
    "   \"label\": {\"value\": \"Documentation\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85108685\",\n",
    "   \"label\": {\"value\": \"Public institutions\", \"lang\": \"en\"}}],\n",
    " \"hasCloseExternalAuthority\": [{\"value\": \"http://www.yso.fi/onto/yso/p2787\",\n",
    "   \"label\": {\"value\": \"kirjastot\", \"lang\": \"fi\"}},\n",
    "  {\"value\": \"http://id.worldcat.org/fast/997341\",\n",
    "   \"label\": {\"value\": \"Libraries\"}},\n",
    "  {\"value\": \"http://d-nb.info/gnd/4006439-6\",\n",
    "   \"label\": {\"value\": \"Bibliothek\", \"lang\": \"de\"}},\n",
    "  {\"value\": \"http://www.wikidata.org/entity/Q7075\",\n",
    "   \"label\": {\"value\": \"library\"}},\n",
    "  {\"value\": \"http://data.bnf.fr/ark:/12148/cb13318325d\",\n",
    "   \"label\": {\"value\": \"Bibliothèques\", \"lang\": \"fr\"}}],\n",
    " \"hasExactExternalAuthority\": [{\"value\": \"http://lod.nal.usda.gov/nalt/47259\",\n",
    "   \"label\": {\"value\": \"libraries\", \"lang\": \"en\"}}],\n",
    " \"hasNarrowerAuthority\": [{\"value\": \"http://id.loc.gov/authorities/subjects/sh85144359\",\n",
    "   \"label\": {\"value\": \"Volunteer workers in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2006003914\",\n",
    "   \"label\": {\"value\": \"Young adult fiction in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85002002\",\n",
    "   \"label\": {\"value\": \"African Americans and libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076716\",\n",
    "   \"label\": {\"value\": \"Library resources\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85064278\",\n",
    "   \"label\": {\"value\": \"Illegal libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh90005545\",\n",
    "   \"label\": {\"value\": \"Computer specialists in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076583\",\n",
    "   \"label\": {\"value\": \"Traveling libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076560\",\n",
    "   \"label\": {\"value\": \"International libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2016001293\",\n",
    "   \"label\": {\"value\": \"Makerspaces in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076572\",\n",
    "   \"label\": {\"value\": \"Rental libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076567\",\n",
    "   \"label\": {\"value\": \"Proprietary libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85123595\",\n",
    "   \"label\": {\"value\": \"Small libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2019103075\",\n",
    "   \"label\": {\"value\": \"Open educational resources in libraries\",\n",
    "    \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh99003406\",\n",
    "   \"label\": {\"value\": \"Association libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2003000502\",\n",
    "   \"label\": {\"value\": \"Joint-use libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh89000080\",\n",
    "   \"label\": {\"value\": \"Gay libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85048069\",\n",
    "   \"label\": {\"value\": \"Fiction in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh95010034\",\n",
    "   \"label\": {\"value\": \"Māori (New Zealand people) and libraries\",\n",
    "    \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2018000796\",\n",
    "   \"label\": {\"value\": \"Wikis and libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh96009061\",\n",
    "   \"label\": {\"value\": \"Cambodian Americans and libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2015000116\",\n",
    "   \"label\": {\"value\": \"Web applications in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85064456\",\n",
    "   \"label\": {\"value\": \"Imaginary books and libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85101156\",\n",
    "   \"label\": {\"value\": \"Photocopying services in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh86003586\",\n",
    "   \"label\": {\"value\": \"Hispanic Americans and libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076505\",\n",
    "   \"label\": {\"value\": \"Branch libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076573\",\n",
    "   \"label\": {\"value\": \"Special libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85113044\",\n",
    "   \"label\": {\"value\": \"Research libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85108703\",\n",
    "   \"label\": {\"value\": \"Public libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076584\",\n",
    "   \"label\": {\"value\": \"Academic libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2006000644\",\n",
    "   \"label\": {\"value\": \"Romanies and libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2002001003\",\n",
    "   \"label\": {\"value\": \"Bulletin boards in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh95006771\",\n",
    "   \"label\": {\"value\": \"Literature in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2003004419\",\n",
    "   \"label\": {\"value\": \"Teenage volunteer workers in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh95008857\",\n",
    "   \"label\": {\"value\": \"Digital libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh88004059\",\n",
    "   \"label\": {\"value\": \"Asian Americans and libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076565\",\n",
    "   \"label\": {\"value\": \"Private libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh87008010\",\n",
    "   \"label\": {\"value\": \"Telecommunication in libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85076576\",\n",
    "   \"label\": {\"value\": \"Subscription libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh99003407\",\n",
    "   \"label\": {\"value\": \"Volunteer libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2014002646\",\n",
    "   \"label\": {\"value\": \"Indian tribal libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2001006867\",\n",
    "   \"label\": {\"value\": \"Hungarian Americans and libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh85118345\",\n",
    "   \"label\": {\"value\": \"School libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh2019000029\",\n",
    "   \"label\": {\"value\": \"Little free libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh96008065\",\n",
    "   \"label\": {\"value\": \"German Americans and libraries\", \"lang\": \"en\"}},\n",
    "  {\"value\": \"http://id.loc.gov/authorities/subjects/sh98003888\",\n",
    "   \"label\": {\"value\": \"Bookbinding libraries\", \"lang\": \"en\"}}],\n",
    " \"hasNarrowerExternalAuthority\": [{\"value\": \"http://id.worldcat.org/fast/997399\",\n",
    "   \"label\": {\"value\": \"Libraries--Forecasting\"}}],\n",
    " \"isMemberOfMADSCollection\": \"http://bibliokeia.com/authorities/Topic/\"}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "ename": "ModuleNotFoundError",
     "evalue": "No module named 'src'",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mModuleNotFoundError\u001b[0m                       Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[6], line 1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01mapi\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01msrc\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01mfunction\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01mauthorities\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01mgetUri\u001b[39;00m \u001b[38;5;28;01mimport\u001b[39;00m GetUri\n\u001b[0;32m      2\u001b[0m \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01mapi\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01msrc\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01mschemas\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01mauthorities\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01mauthority\u001b[39;00m \u001b[38;5;28;01mimport\u001b[39;00m Uri, Variant, AdminMetadata, Element\n\u001b[0;32m      3\u001b[0m \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01mtyping\u001b[39;00m \u001b[38;5;28;01mimport\u001b[39;00m Optional\n",
      "File \u001b[1;32mc:\\Users\\inaci\\Desktop\\BiblioKeia\\api\\src\\function\\authorities\\getUri.py:1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m \u001b[39mfrom\u001b[39;00m \u001b[39msrc\u001b[39;00m\u001b[39m.\u001b[39;00m\u001b[39mfunction\u001b[39;00m\u001b[39m.\u001b[39;00m\u001b[39mloc\u001b[39;00m\u001b[39m.\u001b[39;00m\u001b[39mgraphExist\u001b[39;00m \u001b[39mimport\u001b[39;00m GraphExist\n\u001b[0;32m      2\u001b[0m \u001b[39mfrom\u001b[39;00m \u001b[39mpyfuseki\u001b[39;00m \u001b[39mimport\u001b[39;00m FusekiQuery\n\u001b[0;32m      4\u001b[0m fuseki_query \u001b[39m=\u001b[39m FusekiQuery(\u001b[39m'\u001b[39m\u001b[39mhttp://localhost:3030\u001b[39m\u001b[39m'\u001b[39m, \u001b[39m'\u001b[39m\u001b[39mauthorities\u001b[39m\u001b[39m'\u001b[39m)\n",
      "\u001b[1;31mModuleNotFoundError\u001b[0m: No module named 'src'"
     ]
    }
   ],
   "source": [
    "from api.src.function.authorities.getUri import GetUri\n",
    "from api.src.schemas.authorities.authority import Uri, Variant, AdminMetadata, Element\n",
    "from typing import Optional\n",
    "from pydantic import BaseModel\n",
    "\n",
    "class Subject(BaseModel):\n",
    "    type: str \n",
    "    adminMetadata: AdminMetadata \n",
    "    elementList: list[Element]\n",
    "    note: Optional[str]\n",
    "    hasBroaderAuthority: Optional[list[Uri]]\n",
    "    hasCloseExternalAuthority: Optional[list[Uri]]\n",
    "    hasExactExternalAuthority: Optional[list[Uri]]\n",
    "    hasNarrowerAuthority: Optional[list[Uri]]\n",
    "    hasNarrowerExternalAuthority: Optional[list[Uri]]\n",
    "    hasVariant: Optional[list[Variant]]\n",
    "    subjectOf: Optional[list[Uri]]\n",
    "    isMemberOfMADSCollection: str\n",
    "\n",
    "def ParserSubject(graph, authority):\n",
    "      \n",
    "  prefix = \"\"\"PREFIX identifiers: <http://id.loc.gov/vocabulary/identifiers/>\n",
    "  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "  PREFIX madsrdf: <http://www.loc.gov/mads/rdf/v1#>\"\"\"\n",
    "\n",
    "  # Type\n",
    "  qtype = f\"\"\"{prefix}\n",
    "  SELECT ?type WHERE {{ \n",
    "      <{authority}> rdf:type ?type .\n",
    "      FILTER ( ?type != madsrdf:Authority ) \n",
    "      FILTER ( ?type != skos:Concept )\n",
    "       }}\"\"\"\n",
    "  r = graph.query(qtype)\n",
    "  tipo = r.bindings[0].get('type').split(\"#\")[1]\n",
    "  \n",
    "\n",
    "  # adminMetadata\n",
    "  adminMetadata = {\n",
    "      \"assigner\": \"http://id.loc.gov/vocabulary/organizations/dlc\",\n",
    "      \"identifiedBy\": [ {\n",
    "         \"type\": \"Lccn\",\n",
    "          \"assigner\": \"http://id.loc.gov/vocabulary/organizations/dlc\",\n",
    "          \"value\": authority.split('/')[-1]        \n",
    "      }]      \n",
    "  }\n",
    "  # ElementList\n",
    "  qElementList = f\"\"\"{prefix}\n",
    "  SELECT ?elementValue ?type WHERE  {{\n",
    "    <{authority}> madsrdf:elementList ?o .\n",
    "    ?o rdf:rest* ?node .\n",
    "    ?node rdf:first ?e .\n",
    "    ?e madsrdf:elementValue ?elementValue .\n",
    "    ?e rdf:type ?type\n",
    "    }}\"\"\"\n",
    "  r = graph.query(qElementList)\n",
    "  elementList = list()\n",
    "  for i in r.bindings:\n",
    "      element = {\n",
    "            \"type\": i.get('type').split(\"#\")[1],\n",
    "          \"elementValue\": {\n",
    "            \"value\":  i.get('elementValue').value,\n",
    "            \"lang\": i.get('elementValue').language\n",
    "          }\n",
    "        }\n",
    "      elementList.append(element)\n",
    "\n",
    "  obj = {\n",
    "     \"type\": tipo,\n",
    "      \"adminMetadata\": adminMetadata,\n",
    "      \"elementList\": elementList,\n",
    "      \"isMemberOfMADSCollection\": f'http://bibliokeia.com/authorities/{tipo}/'\n",
    "  }\n",
    "\n",
    "  # Note \n",
    "  qNote = f\"\"\"{prefix}\n",
    "  SELECT ?note WHERE {{ \n",
    "      <{authority}> madsrdf:note ?note .\n",
    "       }}\"\"\"\n",
    "  r = graph.query(qNote)\n",
    "  if len(r.bindings) > 0:\n",
    "     obj['note'] = r.bindings[0].get('note').value\n",
    "\n",
    "# hasVariant\n",
    "  qVariant = f\"\"\"{prefix}\n",
    "  SELECT ?typeVariant ?typeElement ?elementValue WHERE  {{\n",
    "\t<{authority}> madsrdf:hasVariant ?variant .\n",
    "  ?variant rdf:type ?typeVariant .\n",
    "  ?variant madsrdf:elementList ?elementList .\n",
    "  ?elementList rdf:rest* ?node .\n",
    "    ?node rdf:first ?e .\n",
    "    ?e madsrdf:elementValue ?elementValue .\n",
    "\t?e rdf:type ?typeElement .\n",
    "  FILTER ( ?typeVariant != madsrdf:Variant )\n",
    "  }}\"\"\"\n",
    "  r = graph.query(qVariant)\n",
    "  if len(r.bindings) > 0:\n",
    "    variants = list()\n",
    "    for i in r.bindings:\n",
    "      variant = {\n",
    "          'type': i.get('typeVariant').split(\"#\")[1],\n",
    "          'elementList': [{\n",
    "              'type': i.get('typeElement').split(\"#\")[1],\n",
    "              'elementValue': {\n",
    "                  'value': i.get('elementValue').value,\n",
    "                  'lang': i.get('elementValue').language\n",
    "              }\n",
    "          }]\n",
    "      }\n",
    "      variants.append(variant)\n",
    "    obj['hasVariant'] = variants\n",
    "\n",
    "  # URIS\n",
    "  metadados = ['hasBroaderAuthority', \n",
    "               'hasCloseExternalAuthority',\n",
    "    'hasExactExternalAuthority',\n",
    "    'hasNarrowerAuthority',\n",
    "    'hasNarrowerExternalAuthority']\n",
    "  for metadado in metadados:\n",
    "     obj = GetUri(obj, metadado, authority, graph)\n",
    "  \n",
    "  response = Subject(**obj)\n",
    "  return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "request = Subject(**r.json())\n",
    "request"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Ne23b3d7ce6cd4696b6f3fd98cac63395 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph = Graph()\n",
    "authority = 'http://id.loc.gov/authorities/subjects/sh85038731'\n",
    "graph.parse(authority)\n",
    "# graph.serialize('exemples/documentation.ttl')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'ParserSubject' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[4], line 1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m response \u001b[38;5;241m=\u001b[39m \u001b[43mParserSubject\u001b[49m(graph, authority)\n\u001b[0;32m      2\u001b[0m response\u001b[38;5;241m.\u001b[39mdict()\n",
      "\u001b[1;31mNameError\u001b[0m: name 'ParserSubject' is not defined"
     ]
    }
   ],
   "source": [
    "\n",
    "response = ParserSubject(graph, authority)\n",
    "response.dict()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Bibliotecas'"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "binding['label']['value']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['uri', 'label']},\n",
       " 'results': {'bindings': [{'uri': {'type': 'uri',\n",
       "     'value': 'https://bibliokeia.com/authorities/Topic/bkau-1'},\n",
       "    'label': {'type': 'literal', 'value': 'Bibliotecas'}}]}}"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "response.convert()['results']['bindings']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'type': 'Topic',\n",
       " 'adminMetadata': 'adminMetadata',\n",
       " 'elementList': 'elementList',\n",
       " 'isMemberOfMADSCollection': 'http://bibliokeia.com/authorities/tipo/',\n",
       " 'hasNarrowerAuthority': [{'value': 'http://id.loc.gov/authorities/subjects/sh85102444',\n",
       "   'label': {'value': 'PIS (Information retrieval system)', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85003009',\n",
       "   'label': {'value': 'AIS (Information retrieval system)', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85032443',\n",
       "   'label': {'value': 'Copying processes', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85123620',\n",
       "   'label': {'value': 'SMART (Information retrieval system)', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85066148',\n",
       "   'label': {'value': 'Information retrieval', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh2021005166',\n",
       "   'label': {'value': 'Classification--Books--Documentation', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85076502',\n",
       "   'label': {'value': 'Libraries', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85026798',\n",
       "   'label': {'value': 'Classification, Décasépel', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85006913',\n",
       "   'label': {'value': 'Archives', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85085874',\n",
       "   'label': {'value': 'MINSK-ARDIS (Information retrieval system)',\n",
       "    'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85120368',\n",
       "   'label': {'value': 'SESAM (Information retrieval system)', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85013838',\n",
       "   'label': {'value': 'Bibliography', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85000256',\n",
       "   'label': {'value': 'Abstracting', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85013832',\n",
       "   'label': {'value': 'Bibliographical centers', 'lang': 'en'}}]}"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "obj = {\n",
    "     \"type\": \"Topic\",\n",
    "      \"adminMetadata\": \"adminMetadata\",\n",
    "      \"elementList\": \"elementList\",\n",
    "      \"isMemberOfMADSCollection\": f'http://bibliokeia.com/authorities/{\"tipo\"}/'\n",
    "  }\n",
    "obj = GetUri(obj, \"hasNarrowerAuthority\", authority, graph)\n",
    "obj"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N3b3ebc8708944780b54042e56378e903 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "translator = MakeTranslate(\n",
    "            source_language='en',\n",
    "            target_language='pt',\n",
    "            timeout=10\n",
    "        )\n",
    "for k, v in response:\n",
    "    if k == 'elementList':\n",
    "        for j in v:\n",
    "            term = j.elementValue.value\n",
    "            result = translator.translate(term)\n",
    "            j.elementValue.value = result.capitalize()\n",
    "            j.elementValue.lang = 'pt'\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = MakeGraphSubject(response, id)\n",
    "print(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<bound method QueryResult.convert of <SPARQLWrapper.Wrapper.QueryResult object at 0x0000025CEBFC4310>>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fuseki_update = FusekiUpdate('http://localhost:3030', 'authorities')\n",
    "response = fuseki_update.run_sparql(graph)\n",
    "response.convert"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "DOC SOL SUBJECT"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "from api.src.function.authorities.makeLabel import MakeLabel"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "request = response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[Uri(value='http://id.loc.gov/authorities/subjects/sh85038731', label=Label(value='Documentation', lang='en')),\n",
       " Uri(value='http://id.loc.gov/authorities/subjects/sh85108685', label=Label(value='Public institutions', lang='en'))]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "request.hasBroaderAuthority"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'uri': 'http://id.loc.gov/authorities/subjects/sh85038731',\n",
       "  'label': 'Documentation',\n",
       "  'lang': 'en'},\n",
       " {'uri': 'http://id.loc.gov/authorities/subjects/sh85108685',\n",
       "  'label': 'Public institutions',\n",
       "  'lang': 'en'}]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x = [{'uri': i.value, 'label': i.label.value, 'lang': i.label.lang} for i in request.hasBroaderAuthority]\n",
    "x"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "def MakeDocSubject(request, id):\n",
    "\n",
    "    doc = {\n",
    "            'id': id,\n",
    "            'type': request.type,\n",
    "            \"creationDate\": request.adminMetadata.creationDate.strftime('%Y-%m-%d'), \n",
    "            \"label\": f'{MakeLabel(request.elementList)}' ,\n",
    "            \"isMemberOfMADSCollection\": request.isMemberOfMADSCollection\n",
    "        }\n",
    "    for k, v in request:\n",
    "        if v and k not in ['type', 'adminMetadata', 'elementList', 'isMemberOfMADSCollection']:\n",
    "                uri = [{'uri': i.value, 'label': i.label.value, 'lang': i.label.lang} for i in v]\n",
    "                doc[f'{k}'] = uri\n",
    "    return doc\n",
    "doc = MakeDocSubject(request, id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'{\\n  \"responseHeader\":{\\n    \"status\":0,\\n    \"QTime\":821}}\\n'"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "solr = Solr('http://localhost:8983/solr/authorities/', timeout=10)\n",
    "responseSolr = solr.add([doc], commit=True)\n",
    "responseSolr"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "SIMPLE TYPE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = URIRef('http://id.loc.gov/authorities/subjects/sh85076502')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = 'http://id.loc.gov/authorities/subjects/sh85076502'\n",
    "prefix = \"\"\"PREFIX identifiers: <http://id.loc.gov/vocabulary/identifiers/>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX madsrdf: <http://www.loc.gov/mads/rdf/v1#>\"\"\"\n",
    "qlccn = f\"\"\"{prefix}\n",
    "SELECT ?o WHERE {{ \n",
    "    <{uri}> identifiers:lccn ?o }}\"\"\"\n",
    "\n",
    "qType = f\"\"\"{prefix}\n",
    "SELECT ?o WHERE {{ \n",
    "    <{uri}> rdf:type ?o }}\"\"\"\n",
    "\n",
    "qElementList = f\"\"\"{prefix}\n",
    "SELECT ?elementValue ?type WHERE  {{\n",
    "\t<{uri}> madsrdf:elementList ?o .\n",
    "  ?o rdf:rest* ?node .\n",
    "  ?node rdf:first ?e .\n",
    "  ?e madsrdf:elementValue ?elementValue .\n",
    "  ?e rdf:type ?type\n",
    "  }}\"\"\"\n",
    "\n",
    "qComponentList = f\"\"\"{prefix}\n",
    "SELECT * WHERE  {{\n",
    "\t<{uri}> madsrdf:componentList ?componentList .\n",
    "  }}\"\"\"\n",
    "\n",
    "qFullerName = f\"\"\"{prefix}\n",
    "SELECT * WHERE  {{\n",
    "\t<{uri}> madsrdf:fullerName ?fullerName .\n",
    "  }}\"\"\"\n",
    "\n",
    "qBroader = f\"\"\"{prefix}\n",
    "SELECT * WHERE  {{\n",
    "\t<{uri}> madsrdf:hasBroaderAuthority ?value .\n",
    "  ?value madsrdf:authoritativeLabel ?label\n",
    "  }}\"\"\"\n",
    "\n",
    "qCloseExternal = f\"\"\"{prefix}\n",
    "SELECT * WHERE  {{\n",
    "\t<{uri}> madsrdf:hasCloseExternalAuthority ?value .\n",
    "  ?value madsrdf:authoritativeLabel ?label\n",
    "  }}\"\"\"\n",
    "\n",
    "qExactExternal = f\"\"\"{prefix}\n",
    "SELECT * WHERE  {{\n",
    "\t<{uri}> madsrdf:hasExactExternalAuthority ?value .\n",
    "  ?value madsrdf:authoritativeLabel ?label\n",
    "  }}\"\"\"\n",
    "\n",
    "qNarrower = f\"\"\"{prefix}\n",
    "SELECT * WHERE  {{\n",
    "\t<{uri}> madsrdf:hasNarrowerAuthority ?value .\n",
    "  ?value madsrdf:authoritativeLabel ?label\n",
    "  }}\"\"\"\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'hasBroaderAuthority': [{'value': 'http://id.loc.gov/authorities/subjects/sh85038731',\n",
       "   'label': {'value': 'Documentation', 'lang': 'en'}},\n",
       "  {'value': 'http://id.loc.gov/authorities/subjects/sh85108685',\n",
       "   'label': {'value': 'Public institutions', 'lang': 'en'}}]}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def getUri(obj, metadado, authority, graph):\n",
    "    query = f\"\"\"PREFIX madsrdf: <http://www.loc.gov/mads/rdf/v1#>\n",
    "            SELECT * WHERE  {{\n",
    "              <{authority}> madsrdf:{metadado} ?value .\n",
    "              ?value madsrdf:authoritativeLabel ?label\n",
    "              }}\"\"\"\n",
    "    response = graph.query(query)\n",
    "    if len(response.bindings) > 0:\n",
    "        uris = list()\n",
    "        for i in response.bindings:\n",
    "          uri = {\n",
    "                  \"value\": i.get('value').n3().replace('<','').replace('>',''),\n",
    "              \"label\": {\n",
    "                \"value\": i.get('label').value,\n",
    "                \"lang\": i.get('label').language\n",
    "              } }\n",
    "          uris.append(uri)\n",
    "        obj[metadado] = uris\n",
    "    return obj\n",
    "\n",
    "obj = {}\n",
    "uri = 'http://id.loc.gov/authorities/subjects/sh85076502'\n",
    "obj = getUri(obj, \"hasBroaderAuthority\", uri, g)\n",
    "obj\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Authority(type='Topic', identifiers=None, adminMetadata=AdminMetadata(assigner='http://id.loc.gov/vocabulary/organizations/brmninpa', descriptionModifier='http://id.loc.gov/vocabulary/organizations/brmninpa', creationDate=datetime.date(2023, 5, 2), descriptionLanguage='http://id.loc.gov/vocabulary/languages/por', generationProcess=GenerationProcess(label='BiblioKeia Beta', generationDate='2023-05-02T19:56:44'), identifiedBy=IdentifiedBy(assigner='http://id.loc.gov/vocabulary/organizations/brmninpa', value='bkau-1'), status=Status(value='mstatus:new', label='novo')), elementList=[Element(type='TopicElement', elementValue=Label(value='Libraries', lang='en'))], componentList=None, fullerName=None, birthDate=None, birthPlace=None, deathDate=None, occupation=None, hasAffiliation=None, hasBroaderAuthority=[Uri(value='http://id.loc.gov/authorities/subjects/sh85038731', label=Label(value='Documentation', lang='en')), Uri(value='http://id.loc.gov/authorities/subjects/sh85108685', label=Label(value='Public institutions', lang='en'))], subjectOf=None, contributionOf=None, hasCloseExternalAuthority=[Uri(value='http://www.yso.fi/onto/yso/p2787', label=Label(value='kirjastot', lang='fi')), Uri(value='http://id.worldcat.org/fast/997341', label=Label(value='Libraries', lang=None)), Uri(value='http://d-nb.info/gnd/4006439-6', label=Label(value='Bibliothek', lang='de')), Uri(value='http://www.wikidata.org/entity/Q7075', label=Label(value='library', lang=None)), Uri(value='http://data.bnf.fr/ark:/12148/cb13318325d', label=Label(value='Bibliothèques', lang='fr'))], hasExactExternalAuthority=[Uri(value='http://lod.nal.usda.gov/nalt/47259', label=Label(value='libraries', lang='en'))], hasNarrowerAuthority=None, hasVariant=None, isMemberOfMADSCollection='http://id.loc.gov/authorities/subjects/')"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "obj = {\n",
    "    'type': [i.split(\"#\")[1] for [i] in g.query(qType) ][0],\n",
    "    \"adminMetadata\": {\n",
    "    \"generationProcess\": {\n",
    "      \"label\": \"BiblioKeia Beta\"\n",
    "    },\n",
    "    \"identifiedBy\": {\n",
    "      \"assigner\": \"http://id.loc.gov/vocabulary/organizations/brmninpa\",\n",
    "      \"value\": id\n",
    "    }\n",
    "  }, \n",
    "  \"isMemberOfMADSCollection\": \"http://id.loc.gov/authorities/subjects/\"\n",
    "    }\n",
    "\n",
    "[obj['lccn']] = [i[0].value for i in g.query(qlccn) ]\n",
    "\n",
    "# elementList\n",
    "response = g.query(qElementList)\n",
    "if len(response.bindings) > 0:\n",
    "    elementList = list()\n",
    "    for i in response.bindings:\n",
    "      element = {\n",
    "          \"type\": i.get('type').split(\"#\")[1],\n",
    "        \"elementValue\": {\n",
    "          \"value\":  i.get('elementValue').value,\n",
    "          \"lang\": i.get('elementValue').language\n",
    "        }\n",
    "      }\n",
    "      elementList.append(element)\n",
    "    obj['elementList'] = elementList\n",
    "  \n",
    "# ComponentList\n",
    "response = g.query(qComponentList)\n",
    "if len(response.bindings) > 0:\n",
    "    print(\"qComponentList\")\n",
    "\n",
    "# fullerName\n",
    "response = g.query(qComponentList)\n",
    "if len(response.bindings) > 0:\n",
    "    print(\"fullerName\")\n",
    "\n",
    "# birthDate: Optional[str]\n",
    "#     birthPlace: Optional[Uri]\n",
    "#     deathDate: Optional[str]\n",
    "#     occupation: Optional[list[Uri]]\n",
    "#     hasAffiliation: Optional[list[Affiliation]]\n",
    "\n",
    "# hasBroaderAuthority\n",
    "obj = getUri(obj, \"hasBroaderAuthority\", uri, g)\n",
    "\n",
    "# hasCloseExternalAuthority\n",
    "obj = getUri(obj, \"hasCloseExternalAuthority\", uri, g)\n",
    "\n",
    "# hasExactExternalAuthority\n",
    "obj = getUri(obj, \"hasExactExternalAuthority\", uri, g)\n",
    "\n",
    "# hasNarrowerAuthority\n",
    "obj = getUri(obj, \"hasExactExternalAuthority\", uri, g)\n",
    "\n",
    "# hasVariant: \n",
    "\n",
    "\n",
    "\n",
    "\n",
    "request = Authority(**obj)\n",
    "request\n",
    "# obj"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
      "    PREFIX madsrdf: <http://www.loc.gov/mads/rdf/v1#> \n",
      "    PREFIX owl: <http://www.w3.org/2002/07/owl#> \n",
      "    PREFIX ri: <http://id.loc.gov/ontologies/RecordInfo#> \n",
      "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "    PREFIX identifiers: <http://id.loc.gov/vocabulary/identifiers/>\n",
      "    PREFIX bf: <http://id.loc.gov/ontologies/bibframe/> \n",
      "    PREFIX bflc: <http://id.loc.gov/ontologies/bflc/> \n",
      "    PREFIX bkw: <https://bibliokeia.com/resources/work/> \n",
      "    PREFIX menclvl: <http://id.loc.gov/vocabulary/menclvl/>\n",
      "    PREFIX mstatus: <http://id.loc.gov/vocabulary/mstatus/>\n",
      "    PREFIX contentTypes: <http://id.loc.gov/vocabulary/contentTypes/>\n",
      "    PREFIX relators: <http://id.loc.gov/vocabulary/relators/>\n",
      "    PREFIX genreForms: <http://id.loc.gov/authorities/genreForms/>\n",
      "    PREFIX msupplcont: <http://id.loc.gov/vocabulary/msupplcont/>\n",
      "    PREFIX millus: <http://id.loc.gov/vocabulary/millus/>        \n",
      "    INSERT DATA {\n",
      "        GRAPH <https://bibliokeia.com/authorities/Topic/bkau-1>\n",
      "        {\n",
      "        <https://bibliokeia.com/authorities/Topic/bkau-1> a madsrdf:Authority, \n",
      "            madsrdf:Topic ;\n",
      "            identifiers:local \"bkau-1\" ;\n",
      "            madsrdf:adminMetadata [ a bf:AdminMetadata ;\n",
      "            bf:assigner <http://id.loc.gov/vocabulary/organizations/brmninpa> ;\n",
      "            bf:creationDate \"2023-05-02\"^^xsd:date ;\n",
      "            bf:descriptionLanguage <http://id.loc.gov/vocabulary/languages/eng> ;\n",
      "            bf:descriptionModifier <http://id.loc.gov/vocabulary/organizations/brmninpa> ; \n",
      "            bf:generationProcess [ a bf:GenerationProcess ;\n",
      "                    rdfs:label \"BiblioKeia Beta\" ;\n",
      "                    bf:generationDate \"2023-05-02T19:56:44\"^^xsd:dateTime ] ;\n",
      "            bf:identifiedBy [ a bf:Local ;\n",
      "                    bf:assigner <http://id.loc.gov/vocabulary/organizations/brmninpa> ;\n",
      "                    rdf:value \"bkau-1\" ] ; \n",
      "            bf:status mstatus:new ] ; \n",
      "            madsrdf:authoritativeLabel \"Libraries\" ;  \n",
      "            madsrdf:elementList ( [ a madsrdf:TopicElement ;\n",
      "                madsrdf:elementValue \"Libraries\"@en ] ) ;  \n",
      "             \n",
      "                        \n",
      "                 \n",
      "            \n",
      "               \n",
      "            madsrdf:hasBroaderAuthority <http://id.loc.gov/authorities/subjects/sh85038731>, <http://id.loc.gov/authorities/subjects/sh85108685> ;\n",
      "            madsrdf:hasCloseExternalAuthority <http://www.yso.fi/onto/yso/p2787>, <http://id.worldcat.org/fast/997341>, <http://d-nb.info/gnd/4006439-6>, <http://www.wikidata.org/entity/Q7075>, <http://data.bnf.fr/ark:/12148/cb13318325d> ;\n",
      "            madsrdf:hasExactExternalAuthority <http://lod.nal.usda.gov/nalt/47259> ;\n",
      "            \n",
      "            \n",
      "            \n",
      "            madsrdf:isMemberOfMADSCollection <http://id.loc.gov/authorities/subjects/> .          \n",
      "            } \n",
      "        }\n"
     ]
    }
   ],
   "source": [
    "graph = MakeGraph(request, id)\n",
    "print(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<SPARQLWrapper.Wrapper.QueryResult at 0x21a1032d150>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'statusCode': 200, 'message': 'Update succeeded'}"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "response.convert()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'type': 'TopicElement', 'elementValue': {'value': 'Libraries', 'lang': 'en'}}\n"
     ]
    }
   ],
   "source": [
    "response = g.query(qElementList)\n",
    "for i in response.bindings:\n",
    "    element = {\n",
    "         \"type\": i.get('type').split(\"#\")[1],\n",
    "      \"elementValue\": {\n",
    "        \"value\":  i.get('elementValue').value,\n",
    "        \"lang\": i.get('elementValue').language\n",
    "      }\n",
    "    }\n",
    "    print(element)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'TopicElement'"
      ]
     },
     "execution_count": 125,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x = i.get('type').split(\"#\")[1]\n",
    "x"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
      "    PREFIX madsrdf: <http://www.loc.gov/mads/rdf/v1#> \n",
      "    PREFIX owl: <http://www.w3.org/2002/07/owl#> \n",
      "    PREFIX ri: <http://id.loc.gov/ontologies/RecordInfo#> \n",
      "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "    PREFIX identifiers: <http://id.loc.gov/vocabulary/identifiers/>\n",
      "    PREFIX bf: <http://id.loc.gov/ontologies/bibframe/> \n",
      "    PREFIX bflc: <http://id.loc.gov/ontologies/bflc/> \n",
      "    PREFIX bkw: <https://bibliokeia.com/resources/work/> \n",
      "    PREFIX menclvl: <http://id.loc.gov/vocabulary/menclvl/>\n",
      "    PREFIX mstatus: <http://id.loc.gov/vocabulary/mstatus/>\n",
      "    PREFIX contentTypes: <http://id.loc.gov/vocabulary/contentTypes/>\n",
      "    PREFIX relators: <http://id.loc.gov/vocabulary/relators/>\n",
      "    PREFIX genreForms: <http://id.loc.gov/authorities/genreForms/>\n",
      "    PREFIX msupplcont: <http://id.loc.gov/vocabulary/msupplcont/>\n",
      "    PREFIX millus: <http://id.loc.gov/vocabulary/millus/>        \n",
      "    INSERT DATA {\n",
      "        GRAPH <https://bibliokeia.com/authorities/Topic/bk-TESTE>\n",
      "        {\n",
      "        <https://bibliokeia.com/authorities/Topic/bk-TESTE> a madsrdf:Authority, \n",
      "            madsrdf:Topic ;\n",
      "            identifiers:local \"bk-TESTE\" ;\n",
      "            madsrdf:adminMetadata [ a bf:AdminMetadata ;\n",
      "            bf:assigner <http://id.loc.gov/vocabulary/organizations/brmninpa> ;\n",
      "            bf:creationDate \"2023-05-02\"^^xsd:date ;\n",
      "            bf:descriptionLanguage <http://id.loc.gov/vocabulary/languages/eng> ;\n",
      "            bf:descriptionModifier <http://id.loc.gov/vocabulary/organizations/brmninpa> ; \n",
      "            bf:generationProcess [ a bf:GenerationProcess ;\n",
      "                    rdfs:label \"BiblioKeia Beta\" ;\n",
      "                    bf:generationDate \"2023-05-02T14:08:06\"^^xsd:dateTime ] ;\n",
      "            bf:identifiedBy [ a bf:Local ;\n",
      "                    bf:assigner <http://id.loc.gov/vocabulary/organizations/brmninpa> ;\n",
      "                    rdf:value \"bk-1\" ] ;\n",
      "            bf:status mstatus:new ] ; \n",
      "            madsrdf:authoritativeLabel \"Libraries\" ;  \n",
      "            madsrdf:elementList ( [ a madsrdf:TopicElement ;\n",
      "                madsrdf:elementValue \"Libraries\"@en ] ) ;  \n",
      "             \n",
      "                        \n",
      "                 \n",
      "            \n",
      "               \n",
      "            \n",
      "            \n",
      "            \n",
      "            \n",
      "            \n",
      "            \n",
      "            madsrdf:isMemberOfMADSCollection <http://id.loc.gov/authorities/subjects/> .          \n",
      "            } \n",
      "        }\n"
     ]
    }
   ],
   "source": [
    "graph = MakeGraph(request, 'bk-TESTE')\n",
    "print(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N8c2571aa3f5546fdbfcdb568212cd7fa (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.serialize('libraries.ttl', format='ttl')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.11.3 ('venv': venv)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "5df21a170a08fe7c24b5b1091267edae5bad3984f1116f28e957af7dd8f192dc"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
